app/controllers/users_controller.rb

    def create
        @user=User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Siddhi"], ["email", "siddhi@gmail.com"], ["password", "vibhutip"], ["created_at", "2021-03-03 10:29:26.238472"], ["updated_at", "2021-03-03 10:29:26.238472"]]

    def authenticate
        @user=User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "siddhi@gmail.com"], ["LIMIT", 1]]